#include "Lab50305.h"

int main() {

	CList lst1;
    lst1.insertBegin(6); // Вставляємо елемент 6 на початок списку
    lst1.insertBegin(20); // Вставляємо елемент 20 на початок списку
    lst1.insertBegin(600); // Вставляємо елемент 600 на початок списку
    lst1.insertEnd(60); // Вставляємо елемент 60 в кінець списку

    lst1.sort(); // Сортуємо елементи списку у порядку зростання

    lst1.show(true); // Виводимо елементи списку у зворотньому порядку
    lst1.show(); // Виводимо елементи списку у звичайному порядку


	return 0;
}